html/Math/euler-method/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Euler Method</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta http-equiv="X-UA-Compatible" content="ie=edge">
<title>Blah</title>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.2/css/all.min.css" integrity="sha512-1sCRPdkRXhBV2PBLUdRb4tMg1w2YPf37qatUFeS7zlBy7jJI8Lf4VHwWfZZfpXtYSLy85pkm9GaYVYMfw5BC1A==" crossorigin="anonymous" referrerpolicy="no-referrer">
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.10.0/dist/katex.min.css" integrity="sha384-9eLZqc9ds8eNjO3TmqPeYcDj8n+Qfa4nuSiGYa6DjLNcv9BtN69ZIulL9+8CqC9Y" crossorigin="anonymous"/>
</head>
<body>
<div id="preamble" class="status">
<header>
      <h1> Ian Stranathan </h1>
        <nav>
	  <ul>
	    <li><a href="mailto:email@ianstranathan.com"><i class="fa fa-envelope" aria-hidden="true"></i></a></li>
	    <li><a href="https://github.com/ianstranathan"><i class="fa-brands fa-github"></i></a></li>
	  </ul>
	</nav>
    </header>
</div>
<div id="content" class="content">
<h1 class="title">Euler Method</h1>
<p>
Derivation of forward euler method for a <a href="../../../rsc/projects-tools-demos/Projects/JS-&amp;-WebGL/collision_study/">small collision study</a>
I wanted to start simply and this is the most basic, explicit method
for numerically integrating an ODE.
</p>

<div id="outline-container-org21ae599" class="outline-2">
<h2 id="org21ae599">Derivation</h2>
<div class="outline-text-2" id="text-org21ae599">
<hr />
<p>
Recall the limit definition of a derivative:
</p>

<p>
\[ {f^{\prime}(x)} = \lim_{h \to 0} \frac {f(x + h) - f(x)}{h}\]
</p>

<p>
Where \(h\) is some infinitesimal change in a continuous variable. 
</p>

<p>
For a simulation, \(h\) is some small, but
discrete time step associated with the physics tick/ cycle.
</p>

<p>
\[f^{\prime}(t) \approx \frac {f(t + {\Delta t}) - f(t)}{\Delta t}\]
</p>

<p>
Algebraically rearranging for the function at the next time step \(f(x + {\Delta t})\):
</p>

<p>
\[f( t + \Delta{t}) \approx f(t) + f^{\prime}(t) \Delta{t}\]
</p>

<p>
That is to say, we can approximate the value of the next step of a function 
if we have its value and its derivative value at the current time step.
</p>

<p>
We can apply this for the motion in a simulation after
resolving the acceleration of a cycle by working backward:
</p>

<p>
Given position \(\vec r\):
</p>

<p>
Velocity:
\[\vec v = \frac{d}{dt} \vec r\]
</p>

<p>
Acceleration:
\[\vec a = \frac{d}{dt} \vec v\]
</p>

<p>
\[\implies v(t + \Delta t) \approx {v^{\prime}(t)} {\Delta t}  + v(t)\]
</p>

<p>
\[v(t + \Delta t) \approx a(t) {\Delta t}  + v(t)\]
</p>

<p>
Similarly:
\[r(t + \Delta t) \approx {r^{\prime}(t)} {\Delta t}  + r(t)\]
\[r(t + \Delta t) \approx v(t) {\Delta t}  + r(t)\]
</p>


<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #7f7f7f;">// </span><span style="color: #989898;">After resolving acceleration from physics constraints</span>
rigidBody.velocity += acceleration;
rigidBody.position += velocity;
</pre>
</div>
<hr />

<p>
Note:
We're using derivatives, so smoothness is implied for whatever we're trying to look at.
Thus, the same result can be found by using a Taylor series expansion around the next time step
and truncating second order and higher terms.
This is also illustrative of the <span class="underline">limitations</span> of the Euler method, i.e. stability; error is
proportional to the time step squared (second order and greater terms are dropped)
Compare this with an alternative numerical technique such as <a href="../verlet-integration/">verlet integration</a> where the error rate
is proportional to the time step quadrupled.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
    <p>All content on this site is © Ian Stranathan,
      <span id="current-year"></span>.
      <br>Use of this content for training AI or machine learning models is <em>not allowed</em>.
    </p>
  </footer>
<script>document.addEventListener('DOMContentLoaded', function() {
    const yearSpan     = document.getElementById('current-year');
    const h1_name_link = document.getElementById('name-link');
    if (yearSpan) { // Check if the element exists before trying to update it
      yearSpan.textContent = new Date().getFullYear();
    }
    if (h1_name_link) { // Check if the element exists before trying to update it
	h1_name_link.innerHTML = window.location.href === "https://www.ianstranathan.com/" ? "<h1>Ian Stranathan</h1>" : '<h1><a href="https://www.ianstranathan.com/">Ian Stranathan</a></h1>'
    }
  });
</script>
</div>
</body>
</html>
